# IsSlanted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRunType..::..IsSlanted Property
StairsRunType Class See Also
---
True if risers will be slanted, false if they will be straight.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsSlanted { get; set; }
```

Visual Basic
---
```text
Public Property IsSlanted As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsSlanted {
	bool get ();
	void set (bool value);
}
```

# See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace